package bagicjavachapter02;

public class BagicJavaChapter2_2 {

	public static void main(String[] args) {
//		지난시간 기계어에 이어 자바를 CMD환경에서 출력하는 과정까지.
		
		
//		CMD로 컴파일 해본 이유, 환경변수를 알아야하는 이유.
//		개발 환경에서는 프로그램이 알아서 해준다.
		
//		이클립스는 통합개발환경(IDE).
//		자바 진영에서는 이클립스가 있다. (이클립스는 오픈소스)
	
//		2. 이클립스 설치
		
//		@자바기초 시험일정.
//		8장, 11장 마친 후 시험.
//		시험은 수기로 봄.
		
//		이클립스 설정 중 폰트 타입에 대한 설명.
//		주로 사용하는 개발 환경 내의 폰트 타입은 UTF-8
//		고정폭 폰트를 사용하는 것이 좋다고함.
//		설정에서 컴파일러 버전 설정 방법. 설정 -> 자바-> 컴파일러 내에 버전 설정.
//		JDK 경로설정.
		
//		오픈 퍼스펙티브.
//		각각의 개발환경(웹, 앱 등등.)에 따라 환경을 바꿔줄 수 있는 기능.
//		우측 상단에 시트와 노란 플러스버튼.
//		혼공자 20p에 잘 나와있다.
		
//		jdk와 jre의 차이는 java.exe와 javac.exe의 차이.
		
//		주석의 종류 세가지.
		
		// 한줄 주석
		
		/* 여러줄 주석
		 * 
		 */
		
		/** 도큐먼트 주석	API 문서를 만들때 사용하는 주석.
		 *
		 **/
		 // @author JR - 작성자
		 // @since 2022 - 날짜 설정
		 // 와 같은 기능들이 있다.
		
	}

}
